import pandas as pd
import pytest


@pytest.fixture
def num_operations_list() -> list:
    return [
        {
            "Дата операции": "12.01.2021 10:30:58",
            "Дата платежа": "12.01.2021",
            "Номер карты": "",
            "Статус": "OK",
            "Сумма операции": 8000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 8000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Пополнения",
            "MCC": 6012.0,
            "Описание": "Тинькофф Мобайл",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 8000.0,
        },
        {
            "Дата операции": "11.01.2021 14:26:09",
            "Дата платежа": "11.01.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -383.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -383.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Тинькофф Мобайл",
            "Бонусы (включая кэшбэк)": 7,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 383.0,
        },
        {
            "Дата операции": "10.01.2021 16:47:17",
            "Дата платежа": "10.01.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -151.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -151.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Супермаркеты",
            "MCC": 5499.0,
            "Описание": "Тинькофф Мобайл",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 151.0,
        },
        {
            "Дата операции": "10.01.2021 11:38:57",
            "Дата платежа": "10.01.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -68.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -68.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Супермаркеты",
            "MCC": 5499.0,
            "Описание": "Тинькофф Мобайл",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 68.0,
        },
        {
            "Дата операции": "10.01.2021 01:44:42",
            "Дата платежа": "10.01.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -250.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -250.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Связь",
            "MCC": 4814.0,
            "Описание": "Тинькофф Мобайл",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 250.0,
        },
        {
            "Дата операции": "07.01.2021 16:49:20",
            "Дата платежа": "07.01.2021",
            "Номер карты": "",
            "Статус": "OK",
            "Сумма операции": -800.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -800.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Переводы",
            "MCC": "",
            "Описание": "Тинькофф Мобайл",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 800.0,
        },
        {
            "Дата операции": "01.01.2021 18:08:23",
            "Дата платежа": "01.01.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -815.68,
            "Валюта операции": "RUB",
            "Сумма платежа": -815.68,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
            "Бонусы (включая кэшбэк)": 16,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 815.68,
        },
    ]


@pytest.fixture()
def transactions() -> pd.DataFrame:
    transactions_data = [
        {
            "Дата операции": "20.09.2021 12:45:12",
            "Дата платежа": "20.09.2021",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Сумма операции с округлением": 200.00,
        },
        {
            "Дата операции": "15.11.2021 01:02:03",
            "Дата платежа": "15.11.2021",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Сумма операции с округлением": 150.00,
        },
        {
            "Дата операции": "10.12.2021 12:12:12",
            "Дата платежа": "10.12.2021",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Сумма операции с округлением": 100.00,
        },
        {
            "Дата операции": "22.12.2021 00:00:00",
            "Дата платежа": "22.12.2021",
            "Номер карты": "*7197",
            "Категория": "Другие",
            "Сумма операции с округлением": 50.00,
        },
        {
            "Дата операции": "01.10.2021 12:12:13",
            "Дата платежа": "01.10.2021",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Сумма операции с округлением": 100.00,
        },
    ]
    transactions_df = pd.DataFrame(transactions_data)
    return transactions_df


@pytest.fixture()
def small_operations() -> pd.DataFrame:
    transactions_data = [
        {
            "Дата операции": "20.09.2021 12:45:12",
            "Номер карты": "*7197",
            "Категория": "Супермаркеты",
            "Описание": "Магнит",
            "Сумма операции с округлением": 200.00,
        }
    ]
    transactions_df = pd.DataFrame(transactions_data)
    return transactions_df
